# Вопросы по 3 модулю

1. Исключения в Java, Типы исключений(checked/unchecked). Зачем нужна обработка исключений.
2. Ключевое слово throw, ключевое слово throws, try-catch-finally.
3. Иерархия исключений, многоэтажный catch. StackTrace, stderr, stdout.
4. Работа с файлами, чтение и запись в файл, особенности, основные методы.
5. Вложенные классы, отличие статического вложенного класса от внутреннего. Когда следует использовать. 
6. Внутренние классы-члены, Локальные внутренние классы, анонимные классы, примеры.
7. Многопоточность. Потоки и параллелизм, отличие от процесса. Класс Thread, Интерфейс Runnable.
8. Синхронизация потоков, Data races, synchronized, wait, notify, notifyAll. Deadlock.
9. ANR и изменение UI из другого потока. Handler, AsyncTask. Как и зачем использовать.
10. Фрагменты, отличие от Activity, зачем использовать и жизненный цикл. 
11. View canvas. Основные методы и особенности работы.
12. SurfaceView и SurfaceHolder.
13. Сенсоры в Adroid, особенности и типы.
14. Сервисы в Android, отличие от Activity, зачем и как использовать.
